InformationRegisters/like_entititesVersions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>like_entititesVersions</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>entityVersion</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>connection</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.like_connections</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/like_connections.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>like_connections</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>edition</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>version</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>serverState</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>host</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>port</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>login</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>password</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>active</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>isSecure</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>backgroundUpdate</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/like_ConnectionAtServer/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО Изи Клауд, https://izi.cloud
// All rights reserved. This program and accompanying materials 
// are subject to license terms Attribution 4.0 International (CC BY 4.0)
// The license text is available here:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

Function GetConnectionFields(connection) Export
	
	Return New Structure("host,port,user,password,version,edition,isSecure", 
							connection.host, 
							connection.port,
							connection.login,
							connection.password,
							connection.version,
							connection.edition,
							connection.isSecure);
							
EndFunction
						
Function GetActiveConnecton() Export
	
	ConnectionQuery = New Query("SELECT TOP 1
	                            |	like_connections.Ref AS ActiveConnection
	                            |FROM
	                            |	Catalog.like_connections AS like_connections
	                            |WHERE
	                            |	like_connections.active");
	ConnectionSelection = ConnectionQuery.Execute().Select();
	ConnectionSelection.Next();
	Return ConnectionSelection.ActiveConnection;
	
EndFunction

Procedure InitEntitiesVersionsAndServerInfo(connection) Export
	
	InitEntitiesVersions(connection);
	InitServerInfo(connection);
	
EndProcedure

Procedure InitEntitiesVersions(connection)
	
	manager = InformationRegisters.like_entititesVersions.CreateRecordSet();
	filter = manager.Filter;
	filter.connection.Set(connection);
	manager.Read();
	
	If manager.Count() = 0 Then
		aRecord = manager.Add();		
		aRecord.connection = connection;
		aRecord.entityVersion = -1;	
		manager.Write();
	EndIf;
	
EndProcedure

Procedure InitServerInfo(connection)
	
	connectionObject = connection.GetObject();
	ConnectionFields = GetConnectionFields(connection);
	
	ObjectFields = like_CommonAtServer.GetObjectFieldsStructure();
	ObjectFields.ConProps  	 = ConnectionFields;
	ObjectFields.Resource 	 = "/resto/get_server_info.jsp";
	ObjectFields.Namespace 	 = "https://izi.cloud/iiko/reading/serverInfoResponse";
	ObjectFields.TypeName 	 = "r";
	ObjectFields.RequestType = "GET";
	ObjectFields.Headers     = like_Common.getIIKOHeaders(ConnectionFields);
	ObjectFields.isGZIP		 = False;	
	XDTOResponse = like_CommonAtServer.GetIIKOObject(ObjectFields);
	
	If XDTOResponse <> Undefined Then
		FillPropertyValues(connectionObject, XDTOResponse, "version,serverState");
		upCaseEdition = Upper(XDTOResponse.edition);
		connectionObject.edition = "IIKO_"+?(upCaseEdition = "DEFAULT", "RMS", upCaseEdition);
		connectionObject.Write();
	EndIf;
	
EndProcedure

Procedure ActivateDeactivateConnection(connection, state)
	
	ConnectionObject = connection.GetObject();
	ConnectionObject.active = state;
	ConnectionObject.Write();
	
EndProcedure

Procedure HaltActiveConnection() Export
	
	ActiveConnection = GetActiveConnecton();
	If ActiveConnection <> Undefined Then
		ActivateDeactivateConnection(ActiveConnection, False);
	EndIf;	
	
EndProcedure

Procedure SetActiveConnection(connection) Export
	
	HaltActiveConnection();	
	ActivateDeactivateConnection(connection, True);
	InitEntitiesVersionsAndServerInfo(connection);
	like_EntitiesAtServer.BackgroundUpdate();
	
EndProcedure
